app/views/users/index.html.erb

    <li><%= user.username%>:    <%= user.email %>
      <ul><% user.responses.each do |response| %>
---
SELECT "responses".* FROM "responses" WHERE "responses"."user_id" = ?  [["user_id", 1]]