app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Sat, 25 Jan 2014 03:01:42 UTC +00:00], ["email", "test@example.com"], ["updated_at", Sat, 25 Jan 2014 03:01:42 UTC +00:00], ["username", "rita"]]

  def find_matches(user)
    matches = []
    @users = User.all
---
SELECT "users".* FROM "users"